## Plan Result (492: ptlsbox_jenkins - TerraformPlanApply)




<pre><code>Plan: 1 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.dtspo-30477-vault-access[0]
* Update
  * azurerm_key_vault_secret.logicappsecret
  * module.jenkins-webhook-relay.azurerm_logic_app_workflow.logic_app_workflow
  * module.jenkins-webhook-relay.azurerm_resource_group_template_deployment.logic_app_deployment




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.logicappsecret will be updated in-place
  ~ resource "azurerm_key_vault_secret" "logicappsecret" {
        id                      = "https://ptlsbox.vault.azure.net/secrets/github-jenkins-ptlsbox-logicapp/671ee894f8a847b2bcbc2d01cb8be182"
        name                    = "github-jenkins-ptlsbox-logicapp"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # azurerm_role_assignment.dtspo-30477-vault-access[0] will be created
  + resource "azurerm_role_assignment" "dtspo-30477-vault-access" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "446d9962-16af-444c-b72e-ce0f5a99999e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/sds-jenkins-ptlsbox-rg/providers/Microsoft.KeyVault/vaults/ptlsbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.jenkins-webhook-relay.azurerm_logic_app_workflow.logic_app_workflow will be updated in-place
  ~ resource "azurerm_logic_app_workflow" "logic_app_workflow" {
        id                                 = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/github-jenkins-sds-ptlsbox-rg/providers/Microsoft.Logic/workflows/github-jenkins-sds-ptlsbox"
        name                               = "github-jenkins-sds-ptlsbox"
      ~ parameters                         = {
          - "$connections" = jsonencode(
                {
                  - servicebus_1 = {
                      - connectionId   = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/github-jenkins-sds-ptlsbox-rg/providers/Microsoft.Web/connections/github-sb-jenkins-con"
                      - connectionName = "servicebus-connection"
                      - id             = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/providers/Microsoft.Web/locations/uksouth/managedApis/servicebus"
                    }
                }
            ) -> null
        }
        tags                               = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
            "startupMode"  = "always"
        }
      ~ workflow_parameters                = {
          - "$connections" = jsonencode(
                {
                  - defaultValue = {}
                  - type         = "Object"
                }
            ) -> null
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.jenkins-webhook-relay.azurerm_resource_group_template_deployment.logic_app_deployment will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "logic_app_deployment" {
        id                       = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/github-jenkins-sds-ptlsbox-rg/providers/Microsoft.Resources/deployments/logic-app-deployment"
        name                     = "logic-app-deployment"
      ~ output_content           = jsonencode(
            {
              - callbackUrl = {
                  - type  = "String"
                  - value = "https://prod-23.uksouth.logic.azure.com:443/workflows/8d3963a622604366ac916c498a2caa42/triggers/manual/paths/invoke?api-version=2017-07-01&sp=%2Ftriggers%2Fmanual%2Frun&sv=1.0&sig=ZSy33P_hylAI5YDbMYyaZ5C1YT_OEavKpQLnXwItcKU"
                }
            }
        ) -> (known after apply)
      ~ parameters_content       = jsonencode(
          ~ {
              - rg                     = {
                  - value = ""
                }
              - servicebus_queue       = {
                  - value = "jenkins"
                }
                # (6 unchanged attributes hidden)
            }
        )
        tags                     = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
            "startupMode"  = "always"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```

</details>





## :warning: Errors

* failed to add a label 492: ptlsbox_jenkins - TerraformPlanApply/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","PRNumber":109,"Program":"tfcmt","SHA1":"","Target":"492: ptlsbox_jenkins - TerraformPlanApply","Vars":{}} -->